Importing Data as a CSV File

In [107]:
import pandas as pd
data=pd.read_csv("amazon_sales_data_2025.csv")

In [108]:
#print(data)
#print(data.head(10))
#print(data.tail(10))
#print(data.info())
data.describe()
print(data.isnull().sum())

Order ID             0
Date                 0
Product              0
Category             0
Price                2
Quantity             0
Total Sales          0
Customer Name        0
Customer Location    0
Payment Method       0
Status               0
dtype: int64

Handling Duplicate Values

In [109]:
print(data["Order ID"].duplicated())

0      False
1      False
2      False
3      False
4      False
       ...
245    False
246    False
247    False
248    False
249    False
Name: Order ID, Length: 250, dtype: bool

In [110]:
print(data["Order ID"].duplicated().sum())

0

In [111]:
print(data.drop_duplicates("Date"))

    Order ID        Date          Product         Category   Price  Quantity  \
0    ORD0001  14-03-2025    Running Shoes         Footwear    60.0         3
1    ORD0002  20-03-2025       Headphones      Electronics   100.0         4
2    ORD0003  15-02-2025    Running Shoes         Footwear    60.0         2
3    ORD0004  19-02-2025    Running Shoes         Footwear     NaN         3
4    ORD0005  10-03-2025       Smartwatch      Electronics   150.0         3
6    ORD0007  18-03-2025       Smartwatch      Electronics   150.0         4
7    ORD0008  02-03-2025       Smartphone      Electronics   500.0         1
8    ORD0009  08-03-2025          T-Shirt         Clothing    20.0         3
9    ORD0010  12-03-2025       Smartphone      Electronics   500.0         1
10   ORD0011  17-02-2025             Book            Books     NaN         2
11   ORD0012  13-03-2025            Jeans         Clothing    40.0         4
12   ORD0013  01-03-2025           Laptop      Electronics   800.0         2
13   ORD0014  04-03-2025  Washing Machine  Home Appliances   600.0         3
14   ORD0015  20-02-2025       Smartwatch      Electronics   150.0         4
15   ORD0016  26-02-2025     Refrigerator  Home Appliances  1200.0         1
16   ORD0017  01-04-2025          T-Shirt         Clothing    20.0         1
17   ORD0018  10-02-2025       Smartphone      Electronics   500.0         2
18   ORD0019  22-03-2025    Running Shoes         Footwear    60.0         3
19   ORD0020  07-03-2025       Headphones      Electronics   100.0         4
20   ORD0021  05-02-2025       Headphones      Electronics   100.0         3
22   ORD0023  23-02-2025             Book            Books    15.0         1
23   ORD0024  24-03-2025     Refrigerator  Home Appliances  1200.0         3
25   ORD0026  14-02-2025  Washing Machine  Home Appliances   600.0         1
26   ORD0027  07-02-2025          T-Shirt         Clothing    20.0         1
27   ORD0028  03-02-2025       Headphones      Electronics   100.0         1
28   ORD0029  12-02-2025       Smartphone      Electronics   500.0         1
32   ORD0033  04-02-2025             Book            Books    15.0         1
33   ORD0034  02-04-2025          T-Shirt         Clothing    20.0         5
35   ORD0036  09-02-2025     Refrigerator  Home Appliances  1200.0         2
36   ORD0037  16-02-2025       Headphones      Electronics   100.0         3
37   ORD0038  26-03-2025           Laptop      Electronics   800.0         3
41   ORD0042  17-03-2025       Headphones      Electronics   100.0         3
42   ORD0043  08-02-2025          T-Shirt         Clothing    20.0         4
44   ORD0045  15-03-2025     Refrigerator  Home Appliances  1200.0         3
45   ORD0046  06-03-2025    Running Shoes         Footwear    60.0         2
47   ORD0048  11-02-2025          T-Shirt         Clothing    20.0         5
48   ORD0049  18-02-2025       Smartphone      Electronics   500.0         4
51   ORD0052  24-02-2025           Laptop      Electronics   800.0         3
55   ORD0056  19-03-2025       Smartwatch      Electronics   150.0         2
60   ORD0061  11-03-2025     Refrigerator  Home Appliances  1200.0         1
62   ORD0063  30-03-2025       Smartphone      Electronics   500.0         5
63   ORD0064  13-02-2025     Refrigerator  Home Appliances  1200.0         4
64   ORD0065  16-03-2025             Book            Books    15.0         3
66   ORD0067  31-03-2025       Headphones      Electronics   100.0         3
68   ORD0069  25-02-2025     Refrigerator  Home Appliances  1200.0         4
73   ORD0074  25-03-2025     Refrigerator  Home Appliances  1200.0         4
78   ORD0079  09-03-2025    Running Shoes         Footwear    60.0         2
82   ORD0083  28-02-2025  Washing Machine  Home Appliances   600.0         4
84   ORD0085  06-02-2025       Smartphone      Electronics   500.0         5
103  ORD0104  22-02-2025            Jeans         Clothing    40.0         5
114  ORD0115  21-03-2025    Running Shoes         Footwear    60.0         3
116  ORD0117  27-02-2025          T-Shirt         Clothing    20.0         1
121  ORD0122  28-03-2025           Laptop      Electronics   800.0         3
127  ORD0128  23-03-2025       Smartwatch      Electronics   150.0         2
150  ORD0151  29-03-2025  Washing Machine  Home Appliances   600.0         4
175  ORD0176  27-03-2025             Book            Books    15.0         1
180  ORD0181  03-03-2025    Running Shoes         Footwear    60.0         2
201  ORD0202  21-02-2025       Smartphone      Electronics   500.0         2
207  ORD0208  02-02-2025     Refrigerator  Home Appliances  1200.0         3
225  ORD0226  05-03-2025    Running Shoes         Footwear    60.0         4

     Total Sales  Customer Name Customer Location Payment Method     Status
0            180     Emma Clark          New York     Debit Card  Cancelled
1            400  Emily Johnson     San Francisco     Debit Card    Pending
2            120       John Doe            Denver     Amazon Pay  Cancelled
3            180  Olivia Wilson            Dallas    Credit Card    Pending
4            450     Emma Clark          New York     Debit Card    Pending
6            600     Emma Clark           Houston         PayPal  Completed
7            500  Sophia Miller             Miami         PayPal  Completed
8             60  Sophia Miller            Boston         PayPal  Completed
9            500  Emily Johnson     San Francisco    Credit Card  Cancelled
10            30      David Lee            Boston     Amazon Pay    Pending
11           160  Michael Brown            Dallas    Credit Card  Completed
12          1600  Daniel Harris     San Francisco      Gift Card    Pending
13          1800  Michael Brown             Miami    Credit Card  Cancelled
14           600       John Doe           Seattle    Credit Card  Completed
15          1200       John Doe            Boston    Credit Card  Cancelled
16            20     Emma Clark          New York     Amazon Pay  Completed
17          1000  Michael Brown       Los Angeles     Amazon Pay  Completed
18           180  Olivia Wilson           Houston    Credit Card  Completed
19           400  Olivia Wilson           Seattle     Debit Card    Pending
20           300    Chris White             Miami     Debit Card  Cancelled
22            15     Emma Clark           Houston    Credit Card    Pending
23          3600    Chris White            Dallas    Credit Card  Cancelled
25           600  Olivia Wilson            Boston     Debit Card  Cancelled
26            20  Daniel Harris          New York     Amazon Pay    Pending
27           100     Jane Smith           Chicago     Amazon Pay  Completed
28           500  Sophia Miller            Denver    Credit Card  Cancelled
32            15  Olivia Wilson          New York     Debit Card  Cancelled
33           100     Jane Smith          New York    Credit Card    Pending
35          2400  Sophia Miller            Boston         PayPal  Cancelled
36           300  Michael Brown          New York     Debit Card  Cancelled
37          2400  Olivia Wilson           Chicago     Amazon Pay  Completed
41           300     Jane Smith           Chicago     Amazon Pay  Cancelled
42            80     Jane Smith            Denver    Credit Card    Pending
44          3600  Daniel Harris          New York    Credit Card    Pending
45           120      David Lee           Houston     Debit Card  Cancelled
47           100     Jane Smith            Denver     Amazon Pay  Completed
48          2000     Emma Clark           Chicago     Debit Card  Completed
51          2400       John Doe     San Francisco    Credit Card    Pending
55           300     Emma Clark            Dallas    Credit Card  Completed
60          1200     Jane Smith          New York         PayPal  Cancelled
62          2500     Emma Clark             Miami      Gift Card  Completed
63          4800  Emily Johnson            Denver         PayPal    Pending
64            45     Emma Clark     San Francisco     Amazon Pay    Pending
66           300    Chris White          New York     Debit Card    Pending
68          4800      David Lee            Boston      Gift Card    Pending
73          4800     Jane Smith            Dallas      Gift Card  Cancelled
78           120  Emily Johnson            Denver      Gift Card  Cancelled
82          2400     Emma Clark           Houston      Gift Card  Cancelled
84          2500  Michael Brown           Houston         PayPal  Completed
103          200     Jane Smith            Dallas     Debit Card    Pending
114          180  Olivia Wilson             Miami     Amazon Pay  Completed
116           20  Daniel Harris          New York    Credit Card  Completed
121         2400       John Doe             Miami    Credit Card  Cancelled
127          300  Emily Johnson            Dallas         PayPal  Cancelled
150         2400     Jane Smith       Los Angeles     Amazon Pay    Pending
175           15  Michael Brown            Boston     Amazon Pay  Completed
180          120      David Lee       Los Angeles     Debit Card  Cancelled
201         1000  Daniel Harris             Miami    Credit Card  Cancelled
207         3600       John Doe             Miami         PayPal  Completed
225          240    Chris White           Chicago     Amazon Pay  Completed

Handling Null Values

In [112]:
data.head(5).isnull()

,Order ID,Date,Product,Category,Price,Quantity,Total Sales,Customer Name,Customer Location,Payment Method,Status
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False

In [71]:
data.isnull().sum()

Order ID             0
Date                 0
Product              0
Category             0
Price                0
Quantity             0
Total Sales          0
Customer Name        0
Customer Location    0
Payment Method       0
Status               0
dtype: int64

In [113]:
data.head(5).dropna() #dropping null values

,Order ID,Date,Product,Category,Price,Quantity,Total Sales,Customer Name,Customer Location,Payment Method,Status
0,ORD0001,14-03-2025,Running Shoes,Footwear,60.0,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD0002,20-03-2025,Headphones,Electronics,100.0,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD0003,15-02-2025,Running Shoes,Footwear,60.0,2,120,John Doe,Denver,Amazon Pay,Cancelled
4,ORD0005,10-03-2025,Smartwatch,Electronics,150.0,3,450,Emma Clark,New York,Debit Card,Pending

In [114]:
import numpy as np
data.head(5).replace(np.nan, 25000)   #Replacing null values

,Order ID,Date,Product,Category,Price,Quantity,Total Sales,Customer Name,Customer Location,Payment Method,Status
0,ORD0001,14-03-2025,Running Shoes,Footwear,60.0,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD0002,20-03-2025,Headphones,Electronics,100.0,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD0003,15-02-2025,Running Shoes,Footwear,60.0,2,120,John Doe,Denver,Amazon Pay,Cancelled
3,ORD0004,19-02-2025,Running Shoes,Footwear,25000.0,3,180,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD0005,10-03-2025,Smartwatch,Electronics,150.0,3,450,Emma Clark,New York,Debit Card,Pending

In [115]:
data['Price']=data['Price'].replace(np.nan,60)
data.head(5)

,Order ID,Date,Product,Category,Price,Quantity,Total Sales,Customer Name,Customer Location,Payment Method,Status
0,ORD0001,14-03-2025,Running Shoes,Footwear,60.0,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD0002,20-03-2025,Headphones,Electronics,100.0,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD0003,15-02-2025,Running Shoes,Footwear,60.0,2,120,John Doe,Denver,Amazon Pay,Cancelled
3,ORD0004,19-02-2025,Running Shoes,Footwear,60.0,3,180,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD0005,10-03-2025,Smartwatch,Electronics,150.0,3,450,Emma Clark,New York,Debit Card,Pending

In [116]:
print(data['Price'].mean())  #Calculating mean of Price

343.76

In [117]:
#data.fillna(method='bfill')    
data.head(5).bfill()   #Filling Null values
data.head(5).ffill()

,Order ID,Date,Product,Category,Price,Quantity,Total Sales,Customer Name,Customer Location,Payment Method,Status
0,ORD0001,14-03-2025,Running Shoes,Footwear,60.0,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD0002,20-03-2025,Headphones,Electronics,100.0,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD0003,15-02-2025,Running Shoes,Footwear,60.0,2,120,John Doe,Denver,Amazon Pay,Cancelled
3,ORD0004,19-02-2025,Running Shoes,Footwear,60.0,3,180,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD0005,10-03-2025,Smartwatch,Electronics,150.0,3,450,Emma Clark,New York,Debit Card,Pending

In [118]:
data.tail(10).isnull().sum()

Order ID             0
Date                 0
Product              0
Category             0
Price                0
Quantity             0
Total Sales          0
Customer Name        0
Customer Location    0
Payment Method       0
Status               0
dtype: int64

In [119]:
data.head(5)

,Order ID,Date,Product,Category,Price,Quantity,Total Sales,Customer Name,Customer Location,Payment Method,Status
0,ORD0001,14-03-2025,Running Shoes,Footwear,60.0,3,180,Emma Clark,New York,Debit Card,Cancelled
1,ORD0002,20-03-2025,Headphones,Electronics,100.0,4,400,Emily Johnson,San Francisco,Debit Card,Pending
2,ORD0003,15-02-2025,Running Shoes,Footwear,60.0,2,120,John Doe,Denver,Amazon Pay,Cancelled
3,ORD0004,19-02-2025,Running Shoes,Footwear,60.0,3,180,Olivia Wilson,Dallas,Credit Card,Pending
4,ORD0005,10-03-2025,Smartwatch,Electronics,150.0,3,450,Emma Clark,New York,Debit Card,Pending

In [120]:
data.loc[(data['Quantity']==0),"Sale"]='No'
data.loc[(data['Quantity']>0),"Sale"]='Yes'
data.head(5)

,Order ID,Date,Product,Category,Price,Quantity,Total Sales,Customer Name,Customer Location,Payment Method,Status,Sale
0,ORD0001,14-03-2025,Running Shoes,Footwear,60.0,3,180,Emma Clark,New York,Debit Card,Cancelled,Yes
1,ORD0002,20-03-2025,Headphones,Electronics,100.0,4,400,Emily Johnson,San Francisco,Debit Card,Pending,Yes
2,ORD0003,15-02-2025,Running Shoes,Footwear,60.0,2,120,John Doe,Denver,Amazon Pay,Cancelled,Yes
3,ORD0004,19-02-2025,Running Shoes,Footwear,60.0,3,180,Olivia Wilson,Dallas,Credit Card,Pending,Yes
4,ORD0005,10-03-2025,Smartwatch,Electronics,150.0,3,450,Emma Clark,New York,Debit Card,Pending,Yes

In [121]:
#data["Full name"]=data['first name'].str.upper()+" "+data["last name"]   #Concatnating firts name and last name to create new column as full name
#data["Full name"]=data['first name'].str.capitalize()+" "+data["last name"].str.capitalize()  #first letter of first name and last name will be capital

In [122]:
'''data={'months':['January','february','March','April','may','Jun']}
a=pd.DataFrame(data)
print(a)
def extract(value):
    return value[0:3]

a['short months']=a['months'].map(extract)
print(a)'''

"data={'months':['January','february','March','April','may','Jun']}\na=pd.DataFrame(data)\nprint(a)\ndef extract(value):\n    return value[0:3]\n\na['short months']=a['months'].map(extract)\nprint(a)"

In [125]:
gp=data.groupby(["Category"]).agg({"Total Sales":"count"})
gp

                 Total Sales
Category
Books                     25
Clothing                  40
Electronics              118
Footwear                  27
Home Appliances           40

In [135]:
gp1=data.groupby(["Category","Product"]).agg({"Total Sales":"count"})
gp1

                                 Total Sales
Category        Product
Books           Book                      25
Clothing        Jeans                     20
                T-Shirt                   20
Electronics     Headphones                25
                Laptop                    24
                Smartphone                35
                Smartwatch                34
Footwear        Running Shoes             27
Home Appliances Refrigerator              24
                Washing Machine           16

In [136]:
gp2=data.groupby(["Category","Product"]).agg({"Total Sales":"mean"})
gp2

                                 Total Sales
Category        Product
Books           Book               41.400000
Clothing        Jeans             124.000000
                T-Shirt            53.000000
Electronics     Headphones        292.000000
                Laptop           2433.333333
                Smartphone       1385.714286
                Smartwatch        463.235294
Footwear        Running Shoes     160.000000
Home Appliances Refrigerator     3250.000000
                Washing Machine  1687.500000

In [139]:
gp3=data.groupby(["Category","Product"]).agg({"Total Sales":"max","Price":"min"})
gp3

                                 Total Sales   Price
Category        Product
Books           Book                      75    15.0
Clothing        Jeans                    200    40.0
                T-Shirt                  100    20.0
Electronics     Headphones               500   100.0
                Laptop                  4000   800.0
                Smartphone              2500   500.0
                Smartwatch               750   150.0
Footwear        Running Shoes            300    60.0
Home Appliances Refrigerator            6000  1200.0
                Washing Machine         3000   600.0

In [170]:
data1={"Emp ID":["E01","E02","E03","E04","E05","E06"],
      "Names":["Aniket","Ajay","Avishkar","Rushikesh","Apurv","Shubham"],
      "Age":[24,21,20,24,18,18]}
data2={"Emp ID":["E01","E07","E03","E04","E08","E06"],
      "Emp Salary":[36500,75000,80000,45000,65000,90000]}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

In [171]:
print(df1)
print()
print(df2)

  Emp ID      Names  Age
0    E01     Aniket   24
1    E02       Ajay   21
2    E03   Avishkar   20
3    E04  Rushikesh   24
4    E05      Apurv   18
5    E06    Shubham   18

  Emp ID  Emp Salary
0    E01       36500
1    E07       75000
2    E03       80000
3    E04       45000
4    E08       65000
5    E06       90000

In [172]:
print(pd.merge(df1,df2,on ="Emp ID"))   #Merge two dataframes

  Emp ID      Names  Age  Emp Salary
0    E01     Aniket   24       36500
1    E03   Avishkar   20       80000
2    E04  Rushikesh   24       45000
3    E06    Shubham   18       90000

In [190]:
df6=pd.merge(df1,df2,on ="Emp ID", how="inner")
df6

  Emp ID      Names  Age  Emp Salary
0    E01     Aniket   24       36500
1    E03   Avishkar   20       80000
2    E04  Rushikesh   24       45000
3    E06    Shubham   18       90000

In [191]:
pd.merge(df1,df2,on ="Emp ID", how="left")

  Emp ID      Names  Age  Emp Salary
0    E01     Aniket   24     36500.0
1    E02       Ajay   21         NaN
2    E03   Avishkar   20     80000.0
3    E04  Rushikesh   24     45000.0
4    E05      Apurv   18         NaN
5    E06    Shubham   18     90000.0

In [192]:
pd.merge(df1,df2,on ="Emp ID", how="right")

  Emp ID      Names   Age  Emp Salary
0    E01     Aniket  24.0       36500
1    E07        NaN   NaN       75000
2    E03   Avishkar  20.0       80000
3    E04  Rushikesh  24.0       45000
4    E08        NaN   NaN       65000
5    E06    Shubham  18.0       90000

In [193]:
#pd.join(df1,df2)  #Join
#pd.concat(df1,df2)   #It will concatnate 2 equal type of data from dataframes

In [194]:
df5=pd.DataFrame(df6)
df5.pivot(index="Emp ID",columns="Names",values=["Age","Emp Salary"])

          Age                            Emp Salary                     \
Names  Aniket Avishkar Rushikesh Shubham     Aniket Avishkar Rushikesh
Emp ID
E01      24.0      NaN       NaN     NaN    36500.0      NaN       NaN
E03       NaN     20.0       NaN     NaN        NaN  80000.0       NaN
E04       NaN      NaN      24.0     NaN        NaN      NaN   45000.0
E06       NaN      NaN       NaN    18.0        NaN      NaN       NaN


Names   Shubham
Emp ID
E01         NaN
E03         NaN
E04         NaN
E06     90000.0

In [198]:
df7=pd.DataFrame(df6)
df7
pd.melt(df7,id_vars=["Names"],value_vars=["Age"])

       Names variable  value
0     Aniket      Age     24
1   Avishkar      Age     20
2  Rushikesh      Age     24
3    Shubham      Age     18